############################################
# Homebrew taps
############################################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

############################################
# CLI Tools (Core Dev Tools)
############################################
brew "git"
brew "zsh"
brew "python"          # python3
brew "nvm"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "jq"
brew "lazygit"
brew "neovim"
brew "zoxide"
brew "eza"
brew "azure-cli"

############################################
# Additional quality-of-life CLI utilities
############################################
brew "gh"              # GitHub CLI
brew "tree"
brew "wget"


############################################
# Developer Applications
############################################
cask "ghostty"
cask "visual-studio-code"
cask "google-chrome"

############################################
# Optional: tools people usually want
############################################
cask "docker"        # Docker Desktop
cask "bruno"
cask "spotify"
cask "notion"

############################################
# VSCode Extensions (optional)
############################################
vscode "esbenp.prettier-vscode"
vscode "ms-python.python"
vscode "ms-vscode.vscode-typescript-next"
vscode "github.copilot"

############################################
# Mac App Store (if using `mas`)
############################################
# mas "Xcode", id: 497799835
